artillery/test-backend.yaml
config:
  target: http://localhost:3001
  phases:
    - duration: 60
      arrivalRate: 20
  defaults:
    headers:
      Content-Type: application/json
      User-Agent: Artilliery
scenarios:
  - name: enque
    flow:
      - get:
          url: /
      - post:
          url: /enque
          json:
            messageId: "{{$randomNumber(1, 100)}}"
  - name: generate coupon
    flow:
      - get:
          url: /
      - post:
          url: /coupon/generate
          json:
            targetProductId: 1234
            discountRate: 20
            validUntil: "2024-12-31T00:00:00Z"
            couponseCount: 10