artillery/test-backend.yaml
config:
  target: http://localhost:3001
  phases:
    - duration: 60
      arrivalRate: 20
  defaults:
    headers:
      Content-Type: application/json
      User-Agent: Artilliery
scenarios:
  - name: healthcheck
    flow:
      - get:
          url: /
      - post:
          url: /enque
          json:
            messageId: "{{$randomNumber(1, 100)}}"